app/controllers/tasks_controller.rb

  def new
    @task = Task.new
    @current_user = User.find(session[:user_id]) if session[:user_id]
---
SELECT "users".* FROM "users" WHERE "users"."id" = 7 LIMIT 1

  def create
    @task = Task.new(task_params)
    @current_user = User.find(session[:user_id]) if session[:user_id]
    respond_to do |format|

      if @task.save
        format.html { redirect_to tasks_path, notice: "Task was successfully created." }
        format.json { render :show, status: :created, location: @task }
        @current_user.tasks << @task
---
SELECT "users".* FROM "users" WHERE "users"."id" = 20 LIMIT 1
INSERT INTO "tasks" ("created_at", "updated_at", "title", "user_id", "status") VALUES ('2026-09-06 09:39:34.900747', '2026-09-06 09:39:34.900747', '3rd task', NULL, 'pending') RETURNING "id"
INSERT INTO "tasks" ("New_task", "created_at", "updated_at") VALUES ('', '2026-08-29 20:31:36.488675', '2026-08-29 20:31:36.488675') RETURNING "id"

  def update
    respond_to do |format|
      if @task.update(task_params)
---
UPDATE "tasks" SET "updated_at" = '2026-09-30 18:17:13.075345', "title" = 'finish homework 1' WHERE "tasks"."id" = 75

  def destroy
    @task.destroy!
---
DELETE FROM "tasks" WHERE "tasks"."id" = 44

  def update_status

    @task.toggle_status if @task.present?
---
UPDATE "tasks" SET "updated_at" = '2026-09-30 16:31:21.676300', "status" = 'in-progress' WHERE "tasks"."id" = 61

    def set_task
      @task = Task.find(params.expect(:id))
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = 51 LIMIT 1