app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("email", "password_digest", "username", "created_at", "updated_at", "tasks", "password_confirmation") VALUES ('new1@gmail.com', 'new1123', 'new1', '2026-09-05 15:04:28.013587', '2026-09-05 15:04:28.013587', NULL, NULL) RETURNING "id"

  def update
    @user = User.find(params[:id])

    if @user.update(user_params)
---
UPDATE "users" SET "updated_at" = '2026-09-30 15:01:30.972694' WHERE "users"."id" = 35